In [1]:
import pandas as pd
import numpy as np

In [7]:
even = pd.DataFrame({'Even': [0, 2, 4]})
odd = pd.DataFrame({'Odd': [1, 3, 5]})

In [8]:
even

   Even
0     0
1     2
2     4

In [9]:
odd

   Odd
0    1
1    3
2    5

In [11]:
pd.concat([even, odd], axis=1)

   Even  Odd
0     0    1
1     2    3
2     4    5

In [12]:
pd.concat([even, odd], axis=0)

   Even  Odd
0   0.0  NaN
1   2.0  NaN
2   4.0  NaN
0   NaN  1.0
1   NaN  3.0
2   NaN  5.0